{"LuminAid":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/luminaid-update-shark-tank-season-6\/\">LuminAid Update | S6<\/a><\/h2>\n<p>Our LuminAid update is exciting! Mark finalized his deal with the company and has played an important part in helping Andrea and Anna grow LuminAid into a major company. Their products are available on Amazon, as well as the <a href=\"https:\/\/luminaid.com\">LuminAid<\/a> website.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/luminaid-update-shark-tank-season-6\/"},"Fairytale Wishes":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/fairytale-wishes-aromatherapy-bedroom-spray-update-shark-tank-season-5\/\">Fairytale Wishes Update | S5<\/a><\/h2>\n<p>We have sad news to report in our Fairytale Wishes update. The room sprays were sold for a while through the e-commerce site Zulily, and various other online retailers. However, the product is no longer available. With no company website to be found, it appears to be out of business. This will be our final Fairytale Wishes update.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/fairytale-wishes-aromatherapy-bedroom-spray-update-shark-tank-season-5\/"},"Lynnae's Gourmet Pickles":{"recapBody":"<h2><a href=\"sharktankrecap.com\/luminaid-update-shark-tank-season-6\">LuminAid Update | S6<\/a><\/h2>\n<p>Our LuminAid update is exciting! Mark finalized his deal with the company and has played an important part in helping Andrea and Anna grow LuminAid into a major company. Their products are available on Amazon, as well as the <a href=\"https:\/\/luminaid.com\">LuminAid<\/a> website.<\/p>\n","recapLink":"sharktankrecap.com\/luminaid-update-shark-tank-season-6"},"Off The Cob":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/off-the-cob-update-shark-tank-season-6\/\">Off the Cob Update | S6<\/a><\/h2>\n<p>Sadly, we have bad news to share. Research for our Off the Cob update revealed that Cameron seems to have abandoned his company. The tortilla chips are no longer available on Amazon and the last social media account update was posted in 2019, confirming the bad news that Off the Cob is no longer in operation. This will be our final Off the Cob update.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/off-the-cob-update-shark-tank-season-6\/"},"Sleep Pod Blanket by Hug Sleep":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/hug-sleep-update-season-12-episode-3\/\">Shark Tank Hug Sleep Update<\/a><\/h2>\n<p>We have great news to share in our Hug Sleep update! The company is still in business and appears to be doing well.<\/p><p>\nIn recent years, weighted blankets and compression items have become wildly popular. Especially with the rise of anxiety disorders and isolation.<\/p><p>\nThree months after airing, Hug Sleep had amassed $4.1 million in sales, and by 2023, the company listed a net worth of $5 million. That's a pretty great Hug Sleep update considering they started with $2,500!<\/p><p>\nSince the original product launched, they've expanded their product line with a hooded version, and a Sleep Pod for kids. It's no surprise that the company has thousands of good reviews on Amazon.<\/p><p>\nIf you'd like to try their products for yourself, you can get them on the <a href=\"https:\/\/hugsleep.com\">Hug Sleep<\/a> website, Amazon, or through various other retailers.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/hug-sleep-update-season-12-episode-3\/"},"SwimZip":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/swimzip-update-shark-tank-season-5\/\">SwimZip Update | S5<\/a><\/h2>\n<p>Our SwimZip update finds the company is still in business since the airing of the 2014 episode, and they look to be doing pretty well. Their line has been expanded, with products available on Amazon, and the <a href=\"https:\/\/swimzip.com\">SwimZip<\/a> website. Estimates put the company’s net worth at around $5 million.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/swimzip-update-shark-tank-season-5\/"},"Psyonic Bionic Hand":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/psyonic-bionic-hand-update-shark-tank-season-15\/\">Psyonic Update | S15<\/a><\/h2>\n<p>In terms of a Psyonic update, it is a little bit too soon to know how things have turned out. However, we're betting that with time, this company will continue to make a big impact, especially since Dr. Akhtar has 3 sharks on his side now.<\/p><p>\nThere are some pretty compelling videos on the company's Instagram, showing people using the hand. You can learn even more about the Psyonic hand, and sign up for one if you're interested, through the <a href=\"https:\/\/sharktankrecap.com\/psyonic\/\">Psyonic<\/a> website.<\/p><p>\nOnce the dust settles, we will circle back for a more detailed Psyonic update and see what Dr. Akhtar and the shares are up to.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/psyonic-bionic-hand-update-shark-tank-season-15\/"},"Sweet Ballz Gourmet Cake Balls":{"recapBody":"<h2><a href=\"sharktankrecap.com\/luminaid-update-shark-tank-season-6\">LuminAid Update | S6<\/a><\/h2>\n<p>Our LuminAid update is exciting! Mark finalized his deal with the company and has played an important part in helping Andrea and Anna grow LuminAid into a major company. Their products are available on Amazon, as well as the <a href=\"https:\/\/luminaid.com\">LuminAid<\/a> website.<\/p>\n","recapLink":"sharktankrecap.com\/luminaid-update-shark-tank-season-6"},"Zipz Single Serving Wine":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/zipz-update-shark-tank-season-6\/\">Zipz Update | S6<\/a><\/h2>\n<p>You will be excited to learn that Zipz is still in business! Research for our Zipz update revealed that the company is still running as an organization that licenses its packaging technology, though an online presence seems to be absent. They don’t produce their own branded wine any longer and stopped doing so back in 2017. Kevin continues to help find new licensing opportunities for Zipz as they become available.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/zipz-update-shark-tank-season-6\/"},"Coldest Water Bottles":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/coldest-drinkware-update-shark-tank-season-15\/\">Coldest Update | S15<\/a><\/h2>\n<p>Although the brothers struck out on Shark Tank, our Coldest update is a good one. If social media followers and Amazon reviews are any sign of success, we'd say that people love their products.<\/p><p>\nThey entered Shark Tank with millions in sales and thousands of positive reviews. Hopefully, the exposure from the show will help them get their marketing costs down and increase profitability.<\/p><p>\nIf you'd like to do some shopping, you can check out the product line on the <a href=\"https:\/\/coldest.com?ref=nwe3nje\">Coldest<\/a> website.<\/p><p>\nOnce the dust settles, we will circle back for another Coldest update to see what the brothers are up to!<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/coldest-drinkware-update-shark-tank-season-15\/"},"Invisiplug":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/invisiplug-surge-protectors-update-shark-tank-season-5\/\">Invisiplug Update | S5<\/a><\/h2>\n<p>We have pretty shocking news to share. Initially, the product had great sales, with a run on QVC and it also retailed in Target, Staples, and on Amazon. Sadly, things took a bad turn for the company in 2016. Mike threatened someone outside of his home with a semi-automatic handgun, and was charged with assault, and the company went under shortly thereafter. This will be our final Invisiplug update.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/invisiplug-surge-protectors-update-shark-tank-season-5\/"},"Pluto Pillow Personalized Pillows":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/shark-tank-pluto-pillow-update-season-12\/\">Pluto Pillow Update | S12<\/a><\/h2>\n<p>Despite walking away from Shark Tank without a deal, we do have some good news in our Pluto Pillow update. The company has grown quite a bit since the show and we were able to catch up with Susana to talk about what's happened since Shark Tank.<\/p><p>\n\"We've been super fortunate as the product seemed to have resonated well with a national audience,\" Susana told us. She continued, \"After the first night, we were backordered by 6 weeks and sold over 2,000 pillows within a few hours.\"<\/p><p>\nFortunately, Susana shared that this growth continued in the following months and as they released new products. \"We're on track to hit eight figures in 2023,\" Susana shared.<\/p><p>\nFurther, Susana also shared that \"each of our products has won a number of awards\" with the pillow itself winning over ten!<\/p><p>\nWith all the success, Pluto Pillow shows no signs of slowing down and Susana even teased some big plans for 2024. So we will have to follow up with her again down the line for another Pluto Pillow update!<\/p><p>\nIf you'd like to get a pillow, head over to the <a href=\"https:\/\/plutopillow.com\">Pluto Pillow website<\/a>. Susana was kind enough to send me a pillow, and you can read my review of it below!<\/p>\n<h3><strong>Pluto Pillow Review<\/strong><\/h3>\n<p><img src=\"data:image\/svg+xml,%3Csvg%20xmlns='http:\/\/www.w3.org\/2000\/svg'%20viewBox='0%200%201280%20720'%3E%3C\/svg%3E\" alt=\"Pluto pillow review shark tank\" \/><img src=\"https:\/\/sharktankrecap.com\/wp-content\/uploads\/Pluto-Pillow-Review.jpg\" alt=\"Pluto pillow review shark tank\" \/><\/p><p>\nSusana and Kevin were kind enough to send my wife and me our own Pulto Pillows to test out. After sleeping on it for a few weeks, I've got to say, it's pretty amazing and is now my favorite pillow I've used!<\/p><p>\nThe process of creating my pillow was incredibly simple. All that I had to do was visit the website and answer a few questions about my current pillow and sleeping habits. That's it!<\/p><p>\nOutside of the pillow, one thing that stood out to me was the packaging and presentation. The Pluto Pillow came in a custom-designed box and was wrapped beautifully. It had a note inside with my name handwritten on it and even included a piece of candy!<\/p><p>\nI've been sleeping on the pillow for about three weeks now and I can definitely tell a difference in how I sleep. I recently went on vacation and left my Pluto Pillow at home and after the first night of vacation, I wished that I brought it with me!<\/p><p>\nI would highly recommend trying out Pluto Pillow. They have a 125-day money-back guarantee too, so it's risk-free! Enjoy better sleep and <a href=\"https:\/\/sharktankrecap.com\/pluto-pod-premium-travel-neck-pillow-performance-foam-neck-support-for-airplane-sleeping-long-flights-adults-plane-travel-best-airline-flight-pillows-with-adjustable-velcro\/\">order your Pluto Pillow<\/a>!<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/shark-tank-pluto-pillow-update-season-12\/"},"Postcard on the Run":{"recapBody":"<h2><a href=\"sharktankrecap.com\/luminaid-update-shark-tank-season-6\">LuminAid Update | S6<\/a><\/h2>\n<p>Our LuminAid update is exciting! Mark finalized his deal with the company and has played an important part in helping Andrea and Anna grow LuminAid into a major company. Their products are available on Amazon, as well as the <a href=\"https:\/\/luminaid.com\">LuminAid<\/a> website.<\/p>\n","recapLink":"sharktankrecap.com\/luminaid-update-shark-tank-season-6"},"Dogue Dog Food":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/dogue-artisan-dog-food-update-shark-tank-season-15\/\">Dogue Update | S15<\/a><\/h2>\n<p>In terms of a Dogue update, the company will likely get a boost in sales after appearing on Shark Tank, as Kevin suggested. At this time, many of their online products are either low-stock or out of stock. Hopefully, this is an indication that people are loving the products!<\/p><p>\nIf you'd like to check out what they're offering, you can at the <a href=\"https:\/\/doguesfonlinestore.square.site\">Dogue<\/a> website. They sell several other products, in addition to their pastries. These include supplements, meal toppers, and treats.<\/p><p>\nOnce the dust settles, we will circle back for another Dogue update to see what Rahmi and Alejandra are up to!<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/dogue-artisan-dog-food-update-shark-tank-season-15\/"},"RoloDoc Social Media App":{"recapBody":"<h2><a href=\"sharktankrecap.com\/luminaid-update-shark-tank-season-6\">LuminAid Update | S6<\/a><\/h2>\n<p>Our LuminAid update is exciting! Mark finalized his deal with the company and has played an important part in helping Andrea and Anna grow LuminAid into a major company. Their products are available on Amazon, as well as the <a href=\"https:\/\/luminaid.com\">LuminAid<\/a> website.<\/p>\n","recapLink":"sharktankrecap.com\/luminaid-update-shark-tank-season-6"},"Mighty Carver Turkey Chainsaw":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/mighty-carver-chainsaw-electric-knife-update-season-12\/\">What Happened to Mighty Carver After Shark Tank S12<\/a><\/h2>\n<p>We have great news to share in our Mighty Carver update! The company is still in business years later after its Shark Tank appearance.<\/p><p>\nEven better news is that they are worth an estimated $8 million, possibly more! That's a lot of Mighty Carvers sold since the company first appeared on Shark Tank!<\/p><p>\nA quick browse on Amazon reveals that the product is well-liked by customers, with nearly 500 positive reviews. This quirky electric knife carver seems to be a popular gift item.<\/p>\n<h3>Mighty Carver Review<\/h3>\n<p>Lance and Kim were kind enough to send us a Mighty Carver to try for ourselves, and I've got to say, it's so fun! There is some childlike joy that comes from cutting up food with something that looks like a chainsaw.<\/p><p>\nI didn't have a turkey or ham on hand, so I decided to test it out on my wife's homemade bread. She makes sourdough bread, which is pretty tough so I thought it'd be a good way to test the durability of the Mighty Carver.<\/p><p>\n<img src=\"data:image\/svg+xml,%3Csvg%20xmlns='http:\/\/www.w3.org\/2000\/svg'%20viewBox='0%200%201280%20720'%3E%3C\/svg%3E\" alt=\"Mighty Carver Shark Tank Review\" \/><img src=\"https:\/\/sharktankrecap.com\/wp-content\/uploads\/Mighty-Carver-Review.jpg\" alt=\"Mighty Carver Shark Tank Review\" \/><em><strong>My wife's sourdough was no match for the Mighty Carver<\/strong><\/em><\/p><p>\nAs you can see in the image above, it worked great! The Mighty Carver had no problems cutting through the bread and I can only imagine a turkey or ham would be just as easy.<\/p><p>\nThe blades are also easy to pop in and out for when it's time to clean up. Oh, and when you're cutting, be sure to point it down at a 45-degree angle to get it started. If you hold it flat, it'll be a bit more difficult!<\/p><p>\nWant your own Mighty Carver, or know someone who would love to receive it as a gift? You can grab one on Amazon, or on the <a href=\"https:\/\/mightycarver.com\">Mighty Carver<\/a> website.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/mighty-carver-chainsaw-electric-knife-update-season-12\/"},"Bertello Pizza Ovens":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/bertello-pizza-oven-update-shark-tank-season-11\/\">Bertello update | S11<\/a><\/h2>\n<p>Research for our Bertello update revealed that all in all, the company is doing great! Their pizza oven has over 500 reviews on Amazon and as of November 2021, has done over $6.1 million in sales.<\/p><p>\nConsumers seem to be reacting positively to the pizza oven and keep showing off pictures of their perfect pies. Bertello now offers different sizes of ovens and various packages and accessories through the <a href=\"https:\/\/bertello.com\">Bertello<\/a> website and Amazon.<\/p><p>\nIn an exclusive interview with Shark Tank Recap, Eric Bert shared that Kevin has been instrumental to the company. He told us, \"Without Kevin's help, we would never have had the opportunity to do a live primetime QVC Show.\"<\/p><p>\nFurther, \"Kevin is also a chef and really loves using the Bertello, which truly makes him the perfect shark and business partner for us. He is as passionate about our product as we are! I would take the same deal again.\"<\/p><p>\nSo, it sounds like things eventually worked out great for the Bert brothers and likewise, Mr. Wonderful as well!<\/p>\n<h2>Bertello Pizza Oven Review<\/h2>\n<p>Andy and Eric were kind enough to send us a pizza oven so we could add a Bertello review section to this page. I was so excited to try it out, that I invited my whole family over and we cooked a few pizzas together!<\/p><p>\n<img src=\"data:image\/svg+xml,%3Csvg%20xmlns='http:\/\/www.w3.org\/2000\/svg'%20viewBox='0%200%20640%20360'%3E%3C\/svg%3E\" alt=\"Bertello Review\" \/><img src=\"https:\/\/sharktankrecap.com\/wp-content\/uploads\/2022\/05\/Bertello-Review-640x360.jpeg\" alt=\"Bertello Review\" \/><\/p><p>\nThe oven itself is nicely packaged and well-protected. The box itself is very heavy, so be prepared to have some help if you have trouble lifting things over 25 pounds. However, once it was all out of the box, it was pretty easy to assemble and put together.<\/p><p>\nThe instruction manual does a good job of explaining how to put the pieces together and connect them to a propane tank. We have a propane fireplace on our back porch, so we simply connected it to that.<\/p><p>\nYou can cook your pizza with propane, wood chips, or charcoal. We weren't prepared for the wood chips (next time), so we just did it with propane. There are a handful of <a href=\"https:\/\/bertello.com\/pages\/videos-1\">videos on the website<\/a> that you'll want to follow before you cook your pizza. I neglected to watch the videos and ran into a few hiccups. Mainly, we made the pizzas a little too big and didn't let the stone get hot enough.<\/p><p>\nFor reference, you'll want to let the stone sit in the oven for 30 minutes to heat up to around 700-900 degrees Fahrenheit. Additionally, for the pizza, you'll want to make it about the size of a personal pizza, not the size of one you'd get from the store. Thankfully, they only take a few minutes to cook so it's easy to quickly cook a couple of them.<\/p><p>\nSince we didn't make our own dough and simply bought some dough from the grocery store, we didn't quite have enough flour on the bottom of it and had a hard time transferring it from the pan to the stone in the oven. However, we were able to add some flour to the bottom of the second and third pizzas and the transfer was much smoother.<\/p><p>\nPortable Pizza Oven<\/p><p>\n<a href=\"https:\/\/www.amazon.com\/Bertello-Outdoor-Pizza-Black-Combo\/dp\/B08B5HZ3CN?tag=sharktankrecap-20\"> Bertello Outdoor Pizza Oven Black + Pizza Peel Combo <\/a><\/p><p>\n__<\/p><p>\nThe Bertello Outdoor Pizza Oven - Wood and Gas-Fired Outdoor Pizza Oven is the most affordable, high quality, portable, wood fire, charcoal, pellet, and gas outdoor pizza oven available.<\/p><p>\n<a href=\"https:\/\/www.amazon.com\/Bertello-Outdoor-Pizza-Black-Combo\/dp\/B08B5HZ3CN?tag=sharktankrecap-20\"> <img src=\"data:image\/svg+xml,%3Csvg%20xmlns='http:\/\/www.w3.org\/2000\/svg'%20viewBox='0%200%20500%20500'%3E%3C\/svg%3E\" alt=\"Bertello Outdoor Pizza Oven Black + Pizza Peel Combo\" \/><img src=\"https:\/\/m.media-amazon.com\/images\/I\/41a5fQclVGL._SL500_.jpg\" alt=\"Bertello Outdoor Pizza Oven Black + Pizza Peel Combo\" \/> <\/a><\/p><p>\n<a href=\"https:\/\/www.amazon.com\/Bertello-Outdoor-Pizza-Black-Combo\/dp\/B08B5HZ3CN?tag=sharktankrecap-20\"> Check Price on Amazon <\/a><\/p><p>\nWe earn a commission if you make a purchase, at no additional cost to you.<\/p><p>\nOverall, my experience with the Bertello pizza oven was great! My family had a lot of fun making and cooking the pizzas together, and we got better and making pizzas each time. I am fairly confident that next time I am going to make the perfect pie with a few simple adjustments! If you're a pizza lover like me, this is definitely worth the investment.<\/p><p>\nFor those who are interested, Shark Tank Recap fans can get 5% off any purchase by <a href=\"https:\/\/bertello.com\/discount\/SHARKTANKRECAP\">using this link<\/a> or entering the code SHARKTANKRECAP at checkout.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/bertello-pizza-oven-update-shark-tank-season-11\/"},"Nature's Wild Berry Miracle Berries":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/natures-wild-berry-update-shark-tank-season-14\/\">Shark Tank Nature’s Wild Berry Update<\/a><\/h2>\n<p>Our Nature’s Wild Berry update found that the deal with Mark Cuban and Lori Greiner eventually closed successfully.<\/p><p>\nShortly after its episode's airing, the company’s daily sales moved from approximately 40 units to 1,700 units, leading to a complete stock depletion within 10 minutes.<\/p><p>\nThus, this surge resulted in a month-long backorder period as the company worked to replenish inventory.<\/p><p>\nFurthermore, they expanded their product line with several new offerings.<\/p><p>\nThese include the Shark Tank Special, a 50-serving bag priced at $24.99, and the Travel Jar, which contains 25–30 servings and costs $27.99. The Single Pack offers two servings for $3.99.<\/p><p>\nThey also introduced Barely Bears, a fast-acting miracle berry product priced at $16.99 for a bag of 10.<\/p><p>\nActress Jennifer Garner featured the product in a video, expressing amazement at how the berries transformed the taste of lemons and limes into lemonade.<\/p><p>\nOur research on Nature’s Wild Berry reveals that their annual revenue ranges from $250,000 to $500,000. The company has also surpassed $1 million in lifetime sales.<\/p>\n<h3><a href=\"https:\/\/sharktankrecap.com\/natures-wild-berry-update-shark-tank-season-14\/\">Nature's Wild Berry Review<\/a><\/h3>\n<p><img src=\"data:image\/svg+xml,%3Csvg%20xmlns='http:\/\/www.w3.org\/2000\/svg'%20viewBox='0%200%201280%20720'%3E%3C\/svg%3E\" alt=\"Shark Tank Nature's Wild Berry Review\" \/><img src=\"https:\/\/sharktankrecap.com\/wp-content\/uploads\/Natures-Wild-Berry-Review.jpeg\" alt=\"Shark Tank Nature's Wild Berry Review\" \/><\/p><p>\nWe were able to get our hands on a pack of Nature’s Wild Berry to review, and I’ve got to be honest, I was pretty skeptical at first and didn’t really expect it to work.<\/p><p>\nNaturally, I decided to make my wife try it with me. She doesn’t watch Shark Tank, so when I handed her the berry and a lemon wedge and explained that the lemon would taste sweet after she ate the berry, she was quite skeptical.<\/p><p>\nThe packaging says to put the berry in your mouth and move it around for a few seconds before swallowing, which we did. After that, it says that everything you eat for the next 30ish minutes will taste sweet.<\/p><p>\nSo, I bit into the lemon wedge and sure enough, it was sweet! I couldn’t believe it!<\/p><p>\nIt still tasted like a lemon, but it was more sweet and tart instead of sour and tart.<\/p><p>\nOne thing to note is that my wife and I only tried half a berry, for the full experience you’re supposed to eat a full berry. So had I had a full one, I’m sure it would have tasted even sweeter!<\/p><p>\nRegardless, I was super impressed that it actually worked and would recommend it as a fun thing to do with your kids, family, or friends.<\/p><p>\nAs of this writing, Nature's Wild Berry has 68.2K followers on TikTok, 16.8K followers on Instagram, 1.1K followers on Facebook, and 581 subscribers on YouTube.<\/p><p>\nFor more detailed information, you can <a href=\"https:\/\/natureswildberry.com\/\">visit their official website<\/a> or follow their social media profiles.<\/p><p>\nWe can’t wait to check back in for our next Nature’s Wild Berry update on how Hank and Juliano have grown their business.<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/natures-wild-berry-update-shark-tank-season-14\/"},"Cup-a-Bug Insect Catcher":{"recapBody":"<h2><a href=\"https:\/\/sharktankrecap.com\/cup-a-bug-humane-bug-catcher-update-shark-tank-season-15\/\">Cup-A-Bug Update | S15<\/a><\/h2>\n<p>In terms of our Cup-A-Bug update, it's still too early to report on the latest revenue numbers. However, we're sure that Justin will do well following his appearance on Shark Tank.<\/p><p>\nIf you're like Justin and don't like to squash bugs, head over to the <a href=\"https:\/\/cupabug.com\">Cup-A-Bug<\/a> website and place your order.<\/p><p>\nThe website also includes instructional videos, along with plenty of buggy stuff. There's even a bug gallery, that features fan photos of what users have caught in their homes!<\/p><p>\nThere's no doubt, with the help of Mark on Justin's side, Cup-A-Bug will be doing catching bugs all around the country. And hopefully, Justin's entrepreneurial dreams will come true.<\/p><p>\nOnce the dust settles, we will circle back for another Cup-A-Bug update to see what Justin and Mark are up to!<\/p>\n","recapLink":"https:\/\/sharktankrecap.com\/cup-a-bug-humane-bug-catcher-update-shark-tank-season-15\/"}}